config.org
# -*- after-save-hook: org-babel-tangle; -*-
#+title: Emacs config
#+startup: overview
#+property: header-args:emacs-lisp :tangle init.el :results silent
* Table of Contents :TOC:
- [[#early-initialization][Early Initialization]]
  - [[#defaults][Defaults]]
  - [[#utf-8][UTF-8]]
  - [[#disable-early-package-initialization][Disable early package initialization]]
  - [[#gc-tweaks][GC tweaks]]
  - [[#file-handler-tweaks][File handler tweaks]]
  - [[#ui][UI]]
    - [[#common][common]]
    - [[#font][font]]
    - [[#macos][macos]]
  - [[#disable-writing-customization-to-initel][Disable writing customization to ~init.el~]]
- [[#initialization][Initialization]]
- [[#personal-info][Personal Info]]
- [[#package-manager][Package Manager]]
  - [[#use-package][use-package]]
  - [[#package][package]]
  - [[#gnu-elpa-keyring-update][gnu-elpa-keyring-update]]
- [[#feature-flags][Feature Flags]]
  - [[#with-evil][=+with-evil=]]
  - [[#with-icons][=+with-icons=]]
- [[#defaults-1][Defaults]]
  - [[#emacs][emacs]]
  - [[#compile][compile]]
  - [[#ansi-color][ansi-color]]
  - [[#time][time]]
  - [[#calendar][calendar]]
- [[#gc][GC]]
- [[#async][Async]]
- [[#server][Server]]
- [[#keybindings][Keybindings]]
  - [[#repeat][repeat]]
  - [[#which-key][which-key]]
  - [[#evil][evil]]
  - [[#evil-collection][evil-collection]]
  - [[#evil-commentary][evil-commentary]]
  - [[#evil-surround][evil-surround]]
  - [[#evil-org][evil-org]]
  - [[#evil-mc][evil-mc]]
  - [[#evil-terminal-cursor-changer][evil-terminal-cursor-changer]]
  - [[#general][general]]
  - [[#mule][mule]]
  - [[#char-fold][char-fold]]
  - [[#reverse-im][reverse-im]]
- [[#tty][TTY]]
- [[#ui-1][UI]]
  - [[#taskbar][taskbar]]
  - [[#scroll][scroll]]
  - [[#ligatures][ligatures]]
  - [[#icons][icons]]
  - [[#mode-line][mode-line]]
  - [[#doom-modeline][doom-modeline]]
  - [[#modeline-x][modeline-x]]
  - [[#global-mode-string][global-mode-string]]
  - [[#breadcrumb][breadcrumb]]
  - [[#spacious-padding][spacious-padding]]
  - [[#custom-faces][custom-faces]]
  - [[#modus-themes][modus-themes]]
  - [[#modus-catppuccin][modus-catppuccin]]
  - [[#ef-themes][ef-themes]]
  - [[#doric-themes][doric-themes]]
  - [[#doom-themes][doom-themes]]
  - [[#load-theme][load-theme]]
- [[#frames][Frames]]
  - [[#frame][frame]]
  - [[#fringe][fringe]]
- [[#tabs][Tabs]]
  - [[#tab-bar][tab-bar]]
  - [[#project-tab-groups][project-tab-groups]]
  - [[#tab-bar-theme][tab-bar-theme]]
  - [[#per-tab-group-theme][per-tab-group-theme]]
  - [[#tab-line][tab-line]]
- [[#windows][Windows]]
  - [[#window][window]]
  - [[#winum][winum]]
  - [[#zoom][zoom]]
  - [[#shackle][shackle]]
  - [[#popper][popper]]
- [[#buffers][Buffers]]
  - [[#uniquify][uniquify]]
  - [[#buff-menu][buff-menu]]
  - [[#ibuffer][ibuffer]]
  - [[#nerd-icons-ibuffer][nerd-icons-ibuffer]]
  - [[#persistent-scratch][persistent-scratch]]
- [[#history][History]]
  - [[#savehist][savehist]]
  - [[#saveplace][saveplace]]
  - [[#recentf][recentf]]
- [[#session-manager][Session Manager]]
  - [[#desktop][desktop]]
- [[#completion][Completion]]
  - [[#emacs-1][emacs]]
  - [[#mouse][mouse]]
  - [[#nerd-icons-completion][nerd-icons-completion]]
  - [[#consult][consult]]
  - [[#nerd-icons-xref][nerd-icons-xref]]
  - [[#consult-dir][consult-dir]]
  - [[#marginalia][marginalia]]
  - [[#vertico][vertico]]
  - [[#orderless][orderless]]
  - [[#corfu][corfu]]
  - [[#kind-icon][kind-icon]]
  - [[#nerd-icons-corfu][nerd-icons-corfu]]
  - [[#cape][cape]]
  - [[#embark][embark]]
  - [[#embark-consult][embark-consult]]
  - [[#templ][templ]]
  - [[#tempel-collection][tempel-collection]]
- [[#files][Files]]
  - [[#files-1][files]]
  - [[#autorevert][autorevert]]
  - [[#iqa][iqa]]
  - [[#epg][epg]]
- [[#projects][Projects]]
  - [[#project][project]]
  - [[#disproject][disproject]]
  - [[#projection][projection]]
  - [[#projection-multi][projection-multi]]
  - [[#project-x][project-x]]
- [[#dired][Dired]]
  - [[#dired-1][dired]]
  - [[#dired-aux][dired-aux]]
  - [[#dired-x][dired-x]]
  - [[#dired-subtree][dired-subtree]]
  - [[#diredfl][diredfl]]
  - [[#nerd-icons-dired][nerd-icons-dired]]
  - [[#nerd-icons-multimodal][nerd-icons-multimodal]]
  - [[#dired-git-info][dired-git-info]]
  - [[#dired-side][dired-side]]
- [[#environment-variables][Environment Variables]]
  - [[#exec-path-from-shell][exec-path-from-shell]]
  - [[#with-editor][with-editor]]
- [[#help][Help]]
  - [[#help-1][help]]
  - [[#helpful][helpful]]
- [[#editor][Editor]]
  - [[#emacs-2][emacs]]
  - [[#delsel][delsel]]
  - [[#simple][simple]]
  - [[#prog-mode][prog-mode]]
  - [[#so-long][so-long]]
  - [[#hungry-delete][hungry-delete]]
  - [[#elec-pair][elec-pair]]
- [[#ediff][Ediff]]
- [[#undoredo][Undo/Redo]]
  - [[#undo-fu-session][undo-fu-session]]
  - [[#vundo][vundo]]
- [[#highlighting][Highlighting]]
  - [[#hl-line][hl-line]]
  - [[#paren][paren]]
  - [[#paren-face][paren-face]]
  - [[#colorful-mode][colorful-mode]]
  - [[#page-break-lines][page-break-lines]]
  - [[#highlight-indent-guides][highlight-indent-guides]]
  - [[#hl-todo][hl-todo]]
- [[#line-numbers][Line Numbers]]
  - [[#display-line-numbers][display-line-numbers]]
- [[#search][Search]]
  - [[#anzu][anzu]]
  - [[#evil-anzu][evil-anzu]]
- [[#folding][Folding]]
  - [[#hideshow][hideshow]]
- [[#spell-checking][Spell Checking]]
  - [[#jinx][jinx]]
- [[#syntax-checking][Syntax Checking]]
  - [[#flymake][flymake]]
  - [[#sideline][sideline]]
  - [[#sideline-flymake][sideline-flymake]]
- [[#eval][Eval]]
  - [[#eros][eros]]
  - [[#quickrun][quickrun]]
- [[#format][Format]]
  - [[#apheleia][apheleia]]
- [[#goto][Goto]]
  - [[#xref][xref]]
  - [[#avy][avy]]
  - [[#link-hint][link-hint]]
- [[#terminal][Terminal]]
  - [[#ghostel][ghostel]]
  - [[#evil-ghostel][evil-ghostel]]
- [[#git][Git]]
  - [[#vc][vc]]
  - [[#magit][magit]]
  - [[#git-modes][git-modes]]
  - [[#diff-hl][diff-hl]]
  - [[#git-link][git-link]]
  - [[#consult-git-log-grep][consult-git-log-grep]]
  - [[#difftastic][difftastic]]
  - [[#git-timemachine][git-timemachine]]
- [[#org][Org]]
  - [[#org-1][org]]
  - [[#org-archive][org-archive]]
  - [[#org-refile][org-refile]]
  - [[#org-link][org-link]]
  - [[#org-src][org-src]]
  - [[#org-agenda][org-agenda]]
  - [[#org-capture][org-capture]]
  - [[#org-faces][org-faces]]
  - [[#toc-org][toc-org]]
  - [[#org-babel][org-babel]]
    - [[#ob-core][ob-core]]
    - [[#ob-tangle][ob-tangle]]
    - [[#ob-plantuml][ob-plantuml]]
    - [[#verb][verb]]
  - [[#org-crypt][org-crypt]]
- [[#notes][Notes]]
  - [[#deft][deft]]
- [[#lsp][LSP]]
  - [[#eglot][eglot]]
  - [[#dape][dape]]
  - [[#mason][mason]]
- [[#languages][Languages]]
  - [[#treesit][treesit]]
  - [[#elisp][elisp]]
  - [[#clojure][clojure]]
  - [[#golang][golang]]
  - [[#makefile][makefile]]
  - [[#plantuml][plantuml]]
  - [[#sql][sql]]
  - [[#markdown][markdown]]
  - [[#json][json]]
  - [[#yaml][yaml]]
  - [[#lua][lua]]
  - [[#shell][shell]]
  - [[#vimrc][vimrc]]
  - [[#ssh][ssh]]
  - [[#protobuf][protobuf]]
  - [[#dockerfile][dockerfile]]
  - [[#toml][toml]]
- [[#tools][Tools]]
  - [[#editorconfig][editorconfig]]
  - [[#docker][docker]]
  - [[#ansible][ansible]]
  - [[#mise][mise]]
  - [[#proced][proced]]
  - [[#keycast][keycast]]
  - [[#dothttp][dothttp]]
  - [[#flamegraph][flamegraph]]
- [[#llm][LLM]]
  - [[#gptel][gptel]]
  - [[#gptel-magit][gptel-magit]]
  - [[#copilot][copilot]]
- [[#utils][Utils]]

* Early Initialization
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el :results silent
:END:

#+begin_src emacs-lisp
;;; early-init.el --- Early Initialization -*- lexical-binding: t; no-byte-compile: t -*-
#+end_src

** Defaults
#+begin_src emacs-lisp
(setq default-directory "~/")

(setq load-prefer-newer t)
(setq create-lockfiles nil)
(setq ring-bell-function 'ignore)
(setq delete-by-moving-to-trash t)
(setq read-process-output-max (* 1024 1024))
(setq native-comp-async-report-warnings-errors nil)
(setq use-short-answers t) ;; yes-or-no -> y-or-n
#+end_src

** UTF-8
#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
#+end_src

** Disable early package initialization
#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

** GC tweaks
#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (let ((init-time (float-time (time-subtract after-init-time before-init-time)))
                    (packages  (length package-activated-list))
                    (gc-time   (float-time gc-elapsed))
                    (gc-count  gcs-done))
                (message "Emacs ready (init time = %.2fs, packages = %d, gc time = %.2fs, gc count = %d)."
                         init-time packages gc-time gc-count))))
#+end_src

** File handler tweaks
#+begin_src emacs-lisp
(defvar +file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (setq file-name-handler-alist +file-name-handler-alist)))
#+end_src

** UI
*** common
#+begin_src emacs-lisp
(setq inhibit-startup-screen t)
(setq inhibit-startup-message t)

(setq initial-scratch-message nil)

(setq frame-resize-pixelwise t)
(setq window-resize-pixelwise t)

(setq use-dialog-box nil)

(setq-default fringes-outside-margins t)

(tooltip-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)

(add-to-list 'default-frame-alist '(left . 0.5))
(add-to-list 'default-frame-alist '(top  . 0.5))
(add-to-list 'default-frame-alist '(width  . 0.75))
(add-to-list 'default-frame-alist '(height . 0.9))

(add-to-list 'default-frame-alist '(internal-border-width . 0))
#+end_src

*** font
#+begin_src emacs-lisp
(setq inhibit-compacting-font-caches t)
#+end_src

#+begin_src emacs-lisp
;; (defvar +font "JetBrains Mono:weight=medium:size=14")
;; (defvar +font "Iosevka Term:weight=medium:size=14")
;; (defvar +font "Iosevka Term:weight=medium:width=expanded:size=14") ;; Ioesevka Term Extended
;; (defvar +font "Martian Mono Condensed 14")
;; (defvar +font "Cascadia Code:size=16")
;; (defvar +font "Cascadia Code NF:size=16")
;; (defvar +font "Iosevka:size=16")
(defvar +font "Iosevka Term:size=16")

(add-to-list 'default-frame-alist `(font . ,+font))
#+end_src

If you'd like to test a different font, evaluate the following block:
#+begin_src emacs-lisp :tangle no :results silent
(set-frame-font +font)
#+end_src

*** macos
#+begin_src emacs-lisp
(when (featurep 'ns)
  (setq ns-use-proxy-icon nil)
  (setq frame-title-format nil)
  (add-to-list 'default-frame-alist '(undecorated-round . t))
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark)))
#+end_src

** Disable writing customization to ~init.el~
#+begin_src emacs-lisp
;; (setq custom-file null-device)
;; Fix: Error in post-command-hook (vertico--exhibit): (error "Maximum buffer size exceeded")
(setq custom-file (locate-user-emacs-file "custom.el"))
#+end_src

* Initialization
#+begin_src emacs-lisp
;;; init.el --- Initialization -*- lexical-binding: t; no-byte-compile: t -*-
#+end_src

* Personal Info
#+begin_src emacs-lisp
(setq user-full-name "Ruslan Kamashev"
      user-login-name "rynffoll"
      user-mail-address "rynffoll@gmail.com")
#+end_src

* Package Manager
** use-package
#+begin_src emacs-lisp
(setq use-package-always-defer t)
(setq use-package-always-ensure t)
(setq use-package-hook-name-suffix nil)
(setq use-package-enable-imenu-support t)
(setq use-package-compute-statistics t)
(setq use-package-expand-minimally t)
#+end_src

** package
#+begin_src emacs-lisp
(use-package package
  :ensure nil
  :init
  (setq package-review-policy t)
  (setq package-retention-policy t)
  :config
  (add-to-list 'package-archives '("elpa-devel" . "https://elpa.gnu.org/devel/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))
#+end_src

** gnu-elpa-keyring-update
#+begin_src emacs-lisp
(use-package gnu-elpa-keyring-update)
#+end_src

* Feature Flags
#+begin_src emacs-lisp
(defgroup +feature-flags nil
  "Feature flags for this configuration."
  :group 'convenience)
#+end_src

** =+with-evil=
#+begin_src emacs-lisp
(defcustom +with-evil t
  "Enable Evil integration."
  :type 'boolean
  :group '+feature-flags)
#+end_src

** =+with-icons=
#+begin_src emacs-lisp
(defcustom +with-icons t
  "Enable icon integrations."
  :type 'boolean
  :group '+feature-flags)
#+end_src

* Defaults
** emacs
#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :init
  (setq confirm-kill-emacs 'y-or-n-p))
#+end_src

** compile
#+begin_src emacs-lisp
(use-package compile
  :ensure nil
  :init
  (setq compilation-scroll-output 'first-error))
#+end_src

** ansi-color
#+begin_src emacs-lisp
(use-package ansi-color
  :disabled ;; replaced by ghostel
  :ensure nil
  :hook
  (compilation-filter-hook . ansi-color-compilation-filter))
#+end_src

** time
#+begin_src emacs-lisp
(use-package time
  :ensure nil
  :init
  (setq zoneinfo-style-world-list
        '(("America/Mexico_City" "🇲🇽 Mexico City")
          ("America/Bagota"      "🇨🇴 Bogota")
          ("UTC"                 "🕒 UTC")
          ("Europe/Madrid"       "🇪🇸 Barcelona")
          ("Europe/Moscow"       "🇷🇺 Moscow")
          ("Asia/Nicosia"        "🇨🇾 Cyprus")
          ("Asia/Yerevan"        "🇦🇲 Yerevan")
          ("Asia/Almaty"         "🇰🇿 Almaty")))
  (setq world-clock-time-format "%z %R	%a %d %b (%Z)")
  (setq world-clock-sort-order "%FT%T"))
#+end_src

** calendar
#+begin_src emacs-lisp
(use-package calendar
  :ensure nil
  :init
  (setq calendar-date-style 'iso)
  (setq calendar-week-start-day 1))
#+end_src

