init.el
;;; init.el --- Initialization -*- lexical-binding: t; no-byte-compile: t -*-

(setq user-full-name "Ruslan Kamashev"
      user-login-name "rynffoll"
      user-mail-address "rynffoll@gmail.com")

(setq use-package-always-defer t)
(setq use-package-always-ensure t)
(setq use-package-hook-name-suffix nil)
(setq use-package-enable-imenu-support t)
(setq use-package-compute-statistics t)
(setq use-package-expand-minimally t)

(use-package package
  :ensure nil
  :init
  (setq package-review-policy t)
  (setq package-retention-policy t)
  :config
  (add-to-list 'package-archives '("elpa-devel" . "https://elpa.gnu.org/devel/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))

(use-package gnu-elpa-keyring-update)

(defgroup +feature-flags nil
  "Feature flags for this configuration."
  :group 'convenience)

(defcustom +with-evil t
  "Enable Evil integration."
  :type 'boolean
  :group '+feature-flags)

(defcustom +with-icons t
  "Enable icon integrations."
  :type 'boolean
  :group '+feature-flags)

(use-package emacs
  :ensure nil
  :init
  (setq confirm-kill-emacs 'y-or-n-p))

(use-package compile
  :ensure nil
  :init
  (setq compilation-scroll-output 'first-error))

(use-package ansi-color
  :disabled ;; replaced by ghostel
  :ensure nil
  :hook
  (compilation-filter-hook . ansi-color-compilation-filter))

(use-package time
  :ensure nil
  :init
  (setq zoneinfo-style-world-list
        '(("America/Mexico_City" "🇲🇽 Mexico City")
          ("America/Bagota"      "🇨🇴 Bogota")
          ("UTC"                 "🕒 UTC")
          ("Europe/Madrid"       "🇪🇸 Barcelona")
          ("Europe/Moscow"       "🇷🇺 Moscow")
          ("Asia/Nicosia"        "🇨🇾 Cyprus")
          ("Asia/Yerevan"        "🇦🇲 Yerevan")
          ("Asia/Almaty"         "🇰🇿 Almaty")))
  (setq world-clock-time-format "%z %R	%a %d %b (%Z)")
  (setq world-clock-sort-order "%FT%T"))

(use-package calendar
  :ensure nil
  :init
  (setq calendar-date-style 'iso)
  (setq calendar-week-start-day 1))
