config.org
* GC
#+begin_src emacs-lisp
(use-package gcmh
  :unless (fboundp 'igc-info) ;; Emacs 32?
  :init
  (setq gcmh-idle-delay 'auto)
  (setq gcmh-auto-idle-delay-factor 10)
  (setq gcmh-high-cons-threshold (* 64 1024 1024)) ;; 64mb
  :hook
  (emacs-startup-hook . gcmh-mode))
#+end_src

* Async
#+begin_src emacs-lisp
(use-package async
  :hook
  (after-init-hook . async-bytecomp-package-mode)
  (dired-mode-hook . dired-async-mode))
#+end_src

* Server
#+begin_src emacs-lisp
(use-package server
  :ensure nil
  :hook
  (after-init-hook . server-start))
#+end_src

* Keybindings
** repeat
#+begin_src emacs-lisp
(use-package repeat
  :ensure nil
  :hook
  (after-init-hook . repeat-mode))
#+end_src

** which-key
#+begin_src emacs-lisp
(use-package which-key
  :ensure nil
  :init
  (setq which-key-popup-type 'minibuffer)
  (setq which-key-dont-use-unicode nil)
  :hook
  (after-init-hook . which-key-mode))
#+end_src

** evil
#+begin_src emacs-lisp
(use-package evil
  :if +with-evil
  :demand
  :preface
  (defun +save-and-kill-buffer ()
    (interactive)
    (save-buffer)
    (kill-buffer))
  :init
  (setq evil-want-keybinding nil)
  (setq evil-motion-state-cursor 'box)  ;; █
  (setq evil-visual-state-cursor 'box)  ;; █
  (setq evil-normal-state-cursor 'box)  ;; █
  (setq evil-insert-state-cursor 'bar)  ;; ⎸
  (setq evil-emacs-state-cursor  'hbar) ;; _
  (setq evil-symbol-word-search t)
  ;; (setq evil-move-beyond-eol nil)
  ;; (setq evil-move-cursor-back t)
  (setq evil-undo-system 'undo-redo)
  :config
  (evil-ex-define-cmd "q"  'kill-current-buffer)
  (evil-ex-define-cmd "wq" '+save-and-kill-buffer)
  (evil-mode t))
#+end_src

** evil-collection
#+begin_src emacs-lisp
(use-package evil-collection
  :if +with-evil
  :demand
  :after evil
  :init
  (setq evil-collection-repl-submit-state 'insert)
  (setq evil-collection-magit-want-horizontal-movement t)
  :config
  (evil-collection-init)
  ;; Emacs 31 changed `define-globalized-minor-mode' timing, causing
  ;; `evil-normalize-keymaps' to run before `evil-collection-unimpaired-mode'
  ;; activates.  Re-normalize when the per-buffer mode turns on.
  (add-hook 'evil-collection-unimpaired-mode-hook #'evil-normalize-keymaps)
  ;; add diff-hl hunk navigation to unimpaired
  (evil-collection-define-key 'normal 'evil-collection-unimpaired-mode-map
    "[d" 'diff-hl-previous-hunk
    "]d" 'diff-hl-next-hunk))
#+end_src

** evil-commentary
#+begin_src emacs-lisp
(use-package evil-commentary
  :if +with-evil
  :hook
  (after-init-hook . evil-commentary-mode))
#+end_src

** evil-surround
#+begin_src emacs-lisp
(use-package evil-surround
  :if +with-evil
  :hook
  (after-init-hook . global-evil-surround-mode))
#+end_src

** evil-org
#+begin_src emacs-lisp
(use-package evil-org
  :if +with-evil
  :init
  (setq evil-org-key-theme '(todo textobjects insert navigation heading))
  :hook
  (org-mode-hook . evil-org-mode))
#+end_src

#+begin_src emacs-lisp
(use-package evil-org-agenda
  :if +with-evil
  :demand
  :ensure evil-org
  :after org-agenda
  :config
  (evil-org-agenda-set-keys))
#+end_src

** evil-mc
#+begin_src emacs-lisp
(use-package evil-mc
  :if +with-evil
  :hook
  (after-init-hook . global-evil-mc-mode))
#+end_src

** evil-terminal-cursor-changer
#+begin_src emacs-lisp
(use-package evil-terminal-cursor-changer
  :if +with-evil
  :unless (display-graphic-p)
  :init
  (setq etcc-use-color t)
  (setq etcc-use-blink nil)
  :hook
  (after-init-hook . evil-terminal-cursor-changer-activate))
#+end_src

** general
#+begin_src emacs-lisp
(use-package general
  :config
  (general-create-definer +leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC")
  (general-create-definer +local-leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC m"
    :global-prefix "M-SPC m")
  (+leader-def
    ""    '(nil :wk "leader")

    ":"   'execute-extended-command
    "."   'find-file
    ","   'switch-to-buffer

    "0"   'dired-side-jump
    "1"   'winum-select-window-1
    "2"   'winum-select-window-2
    "3"   'winum-select-window-3
    "4"   'winum-select-window-4
    "5"   'winum-select-window-5
    "6"   'winum-select-window-6
    "7"   'winum-select-window-7
    "8"   'winum-select-window-8
    "9"   'winum-select-window-9

    "b"   '(:ignore t :wk "buffer")
    "bb"  'switch-to-buffer
    "bk"  'kill-current-buffer
    "bK"  'kill-buffer-and-window
    "bn"  'evil-buffer-new
    "br"  'revert-buffer
    "bR"  'rename-buffer
    "bs"  'scratch-buffer
    "bl"  'list-buffers
    "bi"  'ibuffer

    "c"   '(:ignore t :wk "code")
    "cr"  'quickrun
    "cf"  'apheleia-format-buffer

    "e"   '(:ignore t :wk "emacs")
    "ed"  'iqa-find-user-init-directory
    "ee"  'iqa-find-user-init-file
    "ec"  'iqa-find-user-custom-file
    "er"  'iqa-reload-user-init-file
    "eR"  'restart-emacs

    "f"   '(:ignore t :wk "file")
    "fl"  'find-library
    "fr"  'recentf-open-files
    "ft"  'dired-side-toggle
    "ff"  'dired-side-follow-file
    "fR"  'crux-rename-file-and-buffer
    "fD"  'crux-delete-file-and-buffer
    "fg"  'magit-file-dispatch

    "F"   '(:ignore t :wk "frame")
    "Ff"  'select-frame-by-name
    "Fn"  'make-frame-command
    "Fc"  'delete-frame
    "FC"  'delete-other-frames
    "Fo"  'other-frame
    "Fb"  'switch-to-buffer-other-frame
    "FM"  'toggle-frame-maximized
    "FF"  'toggle-frame-fullscreen
    "F["  'ns-prev-frame
    "F]"  'ns-next-frame

    "g"   '(:ignore t :wk "git")
    "g."  'magit-dispatch
    "gf"  'magit-file-dispatch
    "gg"  'magit-status
    "gL"  'git-link-dispatch
    "gj"  'consult-git-log-grep
    "gt"  'git-timemachine

    "h"   '(:keymap help-map :package help :wk "help")

    "i"   '(:ignore t :wk "insert")
    "it"  'tempel-insert

    "j"   '(:ignore t :wk "jump") ;; TODO: goto-map (M-g)
    "ji"  'imenu
    "jc"  'avy-goto-char
    "jw"  'avy-goto-word-0
    "jW"  'avy-goto-word-1
    "jl"  'avy-goto-line
    "jL"  'avy-goto-end-of-line

    "l"   '(:ignore t :wk "llm")
    "lg"  'gptel
    "lc"  'claude-code-ide-menu
    "la"  'agent-shell

    "o"   '(:ignore t :wk "open")
    "oc"  'customize-group
    "ol"  'link-hint-open-link
    "ot"  'ghostel
    "oa"  'org-agenda
    "ox"  'org-capture

    "p"   '(:keymap project-prefix-map :package project :wk "project")

    "s"   '(:ignore t :wk "search") ;; TODO: search-map (M-s)
    "sb"  'consult-line
    "sg"  'consult-ripgrep
    "st"  'consult-todo

    "S"   '(:ignore t :wk "session")
    "Ss"  'desktop-save-in-desktop-dir
    "Sr"  'desktop-read

    "TAB" '(:keymap tab-prefix-map :wk "tab-bar")

    "t"   '(:ignore t :wk "toggle")
    "tc"  'colorful-mode
    "tf"  'focus-mode
    "ti"  'highlight-indent-guides-mode
    "tl"  'hl-line-mode
    "tL"  'global-hl-line-mode
    "tn"  'display-line-numbers-mode
    "ts"  'jinx-mode
    "tt"  'load-theme
    "tT"  'toggle-truncate-lines
    "tw"  'whitespace-mode
    "tz"  'olivetti-mode
    "tb"  'breadcrumb-mode
    "tM"  'mode-line-invisible-mode
    )
  (+local-leader-def
    ""    '(nil :wk "local leader")))
#+end_src

** mule
#+begin_src emacs-lisp
(use-package mule
  :ensure nil
  :init
  (setq default-input-method 'russian-computer))
#+end_src

** char-fold
#+begin_src emacs-lisp
(use-package char-fold
  :ensure nil
  :init
  (setq char-fold-symmetric t)
  (setq search-default-mode #'char-fold-to-regexp))
#+end_src

** reverse-im
#+begin_src emacs-lisp
(use-package reverse-im
  :general
  (evil-normal-state-map "C-х" 'evil-force-normal-state)
  (evil-insert-state-map "C-х" 'evil-normal-state)
  (evil-visual-state-map "C-х" 'evil-exit-visual-state)
  :init
  (setq reverse-im-cache-file (locate-user-emacs-file "reverse-im-cache.el"))
  (setq reverse-im-char-fold t)
  (setq reverse-im-read-char-advice-function #'reverse-im-read-char-exclude)
  (setq reverse-im-input-methods '("russian-computer"))
  :hook
  (after-init-hook . reverse-im-mode))
#+end_src

