init.el

(use-package xt-mouse
  :unless (display-graphic-p)
  :ensure nil
  :hook
  (after-init-hook . xterm-mouse-mode))

;; Better window divider in terminal: | -> │
;; https://www.reddit.com/r/emacs/comments/3u0d0u/how_do_i_make_the_vertical_window_divider_more/
(unless (display-graphic-p)
  (with-eval-after-load 'disp-table
    (defun +update-window-divider ()
      (let ((display-table (or buffer-display-table
                               standard-display-table))
            (divider (make-glyph-code ?│)))
        (set-display-table-slot display-table 'vertical-border divider)))
    (add-hook 'window-configuration-change-hook #'+update-window-divider)))

(use-package system-taskbar
  :ensure nil
  :hook
  (after-init-hook . system-taskbar-mode))

(use-package emacs
  :ensure nil
  :init
  (setq scroll-preserve-screen-position t)
  (setq scroll-conservatively 101) ;; scroll one line at a time, no recenter
  (setq scroll-margin 4) ;; lines of context
  (setq fast-but-imprecise-scrolling t)
  (setq redisplay-skip-fontification-on-input t))

(use-package ultra-scroll
  :if (display-graphic-p)
  :init
  (setq scroll-margin 0) ;; important: scroll-margin>0 not yet supported
  :hook
  (after-init-hook . ultra-scroll-mode))

(use-package ligature
  :if (display-graphic-p)
  :config
  (ligature-set-ligatures
   'prog-mode
   '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
     ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
     "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
     "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
     "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
     "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
     "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
     "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
     ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
     "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
     "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
     "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
     "\\\\" "://"))
  :hook
  (after-init-hook . global-ligature-mode))

(use-package nerd-icons
  :if +with-icons
  :config
  (when (and (display-graphic-p)
             (not (member "Symbols Nerd Font Mono" (font-family-list))))
    (nerd-icons-install-fonts)))

(use-package bindings
  :ensure nil
  :init
  ;; (setq mode-line-right-align-edge 'right-fringe)
  (setq mode-line-collapse-minor-modes t)
  (setq mode-line-percent-position nil) ;; move percent to `mode-line-position-column-line-format'
  ;; (setq mode-line-position-column-line-format '("%l:%c:%p"))
  ;; (setq mode-line-position-column-line-format '("%l:%c:" (-3 "%p")))
  (setq mode-line-position-column-line-format '("%l:%c"))
  ;; (setq mode-line-compact t) ;; breaks right-align spacing
  (setq mode-line-modes-delimiters nil)
  )

(use-package doom-modeline
  :init
  (setq doom-modeline-icon +with-icons)
  (setq doom-modeline-modal-icon +with-icons)
  (setq doom-modeline-buffer-encoding 'nondefault)
  (setq doom-modeline-buffer-file-name-style 'buffer-name)
  (setq doom-modeline-check 'simple)
  (setq doom-modeline-unicode-number nil)
  (setq doom-modeline-workspace-name nil)
  ;; :hook
  ;; (after-init-hook . doom-modeline-mode)
  )

(use-package modeline-x
  :ensure nil
  :demand t
  :init
  (setq-default mode-line-format
                '("%e"
                  " "
                  ;; (winum-mode modeline-x-winum)
                  (winum-mode modeline-x-winum-icon)
                  " "
                  ;; (evil-mode modeline-x-evil-state-tag)
                  (evil-mode modeline-x-evil-state-icon)
                  " "
                  modeline-x-buffer-identification
                  " "
                  modeline-x-position
                  " "
                  mode-line-format-right-align
                  modeline-x-misc-info
                  (flymake-mode modeline-x-flymake)
                  " "
                  (vc-mode modeline-x-vc)
                  " "
                  modeline-x-major-mode-icon
                  " "
                  mode-line-modes))
  :config
  (modeline-x-reset))

(use-package emacs
  :ensure nil
  :preface
  (defun +format-input-method ()
    (when-let* ((im (cond
                     (current-input-method
                      current-input-method-title)
                     ((and (bound-and-true-p evil-local-mode)
                           (bound-and-true-p evil-input-method))
                      ;; (INPUT-METHOD LANGUAGE-ENV ACTIVATE-FUNC TITLE DESCRIPTION ARGS...)
                      ;; (0            1            2             3     4           5   ...)
                      (nth 3 (assoc evil-input-method input-method-alist))))))
      (concat " " (propertize im 'face 'bold) " ")))
  :config
  (add-to-list 'global-mode-string '(:eval (+format-input-method))))

(use-package breadcrumb
  :hook
  (after-init-hook . breadcrumb-mode))

(use-package spacious-padding
  :if (display-graphic-p))

(defun +custom-faces (&rest _)
  "Reapply custom face attributes after theme load."
  (custom-set-faces
   `(mode-line
     ((t (:height 0.9 :box (:line-width 3 :style nil :color ,(face-attribute 'mode-line :background nil 'default))))))
   `(mode-line-active
     ((t (:height 0.9 :box (:line-width 3 :style nil :color ,(face-attribute 'mode-line-active :background nil 'default))))))
   `(mode-line-inactive
     ((t (:height 0.9 :box (:line-width 3 :style nil :color ,(face-attribute 'mode-line-inactive :background nil 'default))))))
   ;; do not change header-line height because it breaks alignment in proced, profile-report, etc.
   ;; '(header-line                    ((t (:height 0.9))))
   ;; '(header-line-inactive           ((t (:height 0.9))))
   '(evil-ex-substitute-matches     ((t (:inherit diff-removed :foreground unspecified :background unspecified :strike-through t))))
   '(evil-ex-substitute-replacement ((t (:inherit diff-added   :foreground unspecified :background unspecified :underline nil))))
   '(diredfl-dir-name               ((t (:bold t))))
   '(vundo-highlight                ((t (:inherit success :foreground unspecified))))
   '(vundo-last-saved               ((t (:inherit error   :foreground unspecified))))
   '(vundo-saved                    ((t (:inherit warning :foreground unspecified))))
   '(eros-result-overlay-face       ((t (:inherit shadow :box t))))
   '(cider-result-overlay-face      ((t (:inherit shadow :box t))))
   '(org-tag                        ((t (:inherit shadow :foreground unspecified :background unspecified :bold nil))))
   ;; '(org-ellipsis                   ((t (:underline nil))))
   ;; '(org-block-begin-line           ((t (:underline nil))))
   ;; '(org-block-end-line             ((t (:overline nil))))
   '(dape-breakpoint-face           ((t (:inherit error))))
   '(hs-ellipsis                    ((t (:inherit shadow))))
   ))

(add-hook 'enable-theme-functions #'+custom-faces)
