config.org
** modus-themes
#+begin_src emacs-lisp
(use-package modus-themes
  ;; :ensure nil
  :pin melpa-stable
  :init
  (setq modus-themes-bold-constructs t)
  (setq modus-themes-italic-constructs t)
  (setq modus-themes-common-palette-overrides
        '(;; (bg-region bg-cyan-intense)
          (fg-region unspecified)
          (bg-prose-block-delimiter bg-inactive)
          (fg-prose-block-delimiter fg-dim)
          (bg-prose-block-contents bg-dim)
          (fringe unspecified)
          (border-mode-line-active unspecified)
          (border-mode-line-inactive unspecified)
          )))
#+end_src

** modus-catppuccin
#+begin_src emacs-lisp
(use-package modus-catppuccin
  :vc (:url "https://gitlab.com/magus/modus-catppuccin.git" :rev :newest))
#+end_src

** ef-themes
#+begin_src emacs-lisp
(use-package ef-themes)
#+end_src

** doric-themes
#+begin_src emacs-lisp
(use-package doric-themes)
#+end_src

** doom-themes
#+begin_src emacs-lisp
(use-package doom-themes
  :init
  (setq doom-themes-enable-italic t)
  :config
  (doom-themes-org-config))
#+end_src

** load-theme
#+begin_src emacs-lisp
(setq +theme-alist '((default . modus-operandi)
                     (light   . modus-operandi)
                     (dark    . ef-dream)))

(defun +theme-change (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (when-let* ((theme (alist-get appearance +theme-alist)))
    (mapc #'disable-theme custom-enabled-themes)
    (load-theme theme :no-confirm)))

(defun +theme-toggle ()
  "Toggle between light and dark themes."
  (interactive)
  (if (memq (alist-get 'dark +theme-alist) custom-enabled-themes)
      (+theme-change 'light)
    (+theme-change 'dark)))

(if (and (display-graphic-p)
         (eq window-system 'ns)
         (boundp 'ns-system-appearance-change-functions))
    (add-hook 'ns-system-appearance-change-functions #'+theme-change)
  (load-theme (alist-get 'default +theme-alist) :no-confirm))
#+end_src

* Frames
** frame
#+begin_src emacs-lisp
(use-package frame
  :ensure nil
  :preface
  (defun +reset-frame-parameters ()
    "Reset frame parameters to default values."
    (interactive)
    (modify-frame-parameters
     nil
     (seq-filter (lambda (param)
                   (memq (car param) '(left top width height)))
                 default-frame-alist)))
  :config
  (blink-cursor-mode -1))
#+end_src

** fringe
#+begin_src emacs-lisp
(use-package fringe
  :if (display-graphic-p)
  :ensure nil
  :init
  (setf (cdr (assq 'continuation fringe-indicator-alist))
        '(nil nil) ;; no continuation indicators
        ;; '(nil right-curly-arrow) ;; right indicator only
        ;; '(left-curly-arrow nil) ;; left indicator only
        ;; '(left-curly-arrow right-curly-arrow) ;; default
        ))
#+end_src

* Tabs
** tab-bar
#+begin_src emacs-lisp
(use-package tab-bar
  :ensure nil
  :general
  (tab-prefix-map
   "TAB" 'tab-recent
   "0" 'tab-recent
   "1" 'tab-bar-select-tab
   "2" 'tab-bar-select-tab
   "3" 'tab-bar-select-tab
   "4" 'tab-bar-select-tab
   "5" 'tab-bar-select-tab
   "6" 'tab-bar-select-tab
   "7" 'tab-bar-select-tab
   "8" 'tab-bar-select-tab
   "9" 'tab-last
   "." 'tab-switch
   "n" 'tab-new
   "[" 'tab-previous
   "]" 'tab-next
   ">" 'tab-move
   "<" 'tab-bar-move-tab-backward
   "c" 'tab-close
   "C" 'tab-close-other)
  (evil-window-map
   "u" 'tab-bar-history-back
   "U" 'tab-bar-history-forward)
  :init
  (setq tab-bar-format '(tab-bar-separator
                         tab-bar-format-menu-bar
                         tab-bar-format-tabs-groups
                         tab-bar-format-align-right
                         tab-bar-format-global))
  (setq tab-bar-close-button-show nil)
  (setq tab-bar-new-tab-choice "*scratch*")
  (setq tab-bar-tab-hints t)
  (setq tab-bar-separator " ")
  (setq tab-bar-auto-width nil)
  :config
  (add-to-list 'tab-bar-tab-name-format-functions
               #'tab-bar-tab-name-format-truncated)
  :hook
  (after-init-hook . tab-bar-mode)
  (after-init-hook . tab-bar-history-mode))
#+end_src

** project-tab-groups
#+begin_src emacs-lisp
(use-package project-tab-groups
  :hook
  (after-init-hook . project-tab-groups-mode))
#+end_src

** tab-bar-theme
#+begin_src emacs-lisp
(use-package tab-bar-theme
  :ensure nil
  :init
  (setq tab-bar-theme-height 0.9)
  :hook
  (after-init-hook . tab-bar-theme-mode))
#+end_src

** per-tab-group-theme
#+begin_src emacs-lisp
(use-package per-tab-group-theme
  :disabled
  :ensure nil
  :hook
  (after-init-hook . per-tab-group-theme-mode))
#+end_src

** tab-line
#+begin_src emacs-lisp
(use-package tab-line
  :ensure nil
  :init
  (setq tab-line-close-button-show nil)
  (setq tab-line-new-button-show nil))
#+end_src

* Windows
** window
#+begin_src emacs-lisp
(use-package window
  :ensure nil
  :general
  (evil-window-map
   "m" 'maximize-window
   "M" 'minimize-window))
#+end_src

** winum
#+begin_src emacs-lisp
(use-package winum
  :init
  (setq winum-scope 'frame-local)
  (setq winum-auto-setup-mode-line nil)
  (setq winum-format "%s")
  :hook
  (after-init-hook . winum-mode))
#+end_src

** zoom
#+begin_src emacs-lisp
(use-package zoom
  :general
  (evil-window-map
   "z" 'zoom-mode)
  :init
  (setq zoom-size '(0.618 . 0.618)) ;; golden ratio
  (setq zoom-ignored-major-modes '(vundo-mode vundo-diff-mode))
  (setq zoom-ignored-buffer-names '("COMMIT_EDITMSG" " *vundo tree*"))
  (setq zoom-ignored-buffer-name-regexps '("^magit.*" "^\\*dape.*")))
#+end_src

** shackle
#+begin_src emacs-lisp
(use-package shackle
  :init
  (setq shackle-default-size 0.4)
  (setq shackle-rules
        '((help-mode :align below :select t)
          (helpful-mode :align below)
          (cider-repl-mode :align below)
          (ansible-doc-module-mode :align below)
          ("\\*Async Shell Command\\*.*" :regexp t :ignore t)
          (Man-mode :align below :select t)
          ("\\*Man.*\\*" :regexp t :align below :select t)
          ;; ("*Warnings*" :align below)
          ("*Compile-Log*" :align below)
          (compilation-mode :align below)
          ("\\*vc-git :.*" :regexp t :align below :ignore t :select t)
          ("\\*docker-compose .*\\*" :regexp t :align below)
          (comint-mode :align below)
          ("*compilation*" :align below)
          (ghostel-compile-view-mode :align below)))
  :hook
  (after-init-hook . shackle-mode))
#+end_src

** popper
#+begin_src emacs-lisp
(use-package popper
  :disabled
  :general
  ("C-`"   'popper-toggle-latest)
  ("C-§"   'popper-toggle-latest)
  ;; ("M-`"   'popper-cycle)
  ;; ("M-~"   'popper-cycle-backwards)
  ("C-M-`" 'popper-toggle-type)
  ("C-M-§" 'popper-toggle-type)
  :init
  (setq popper-mode-line '(:eval (propertize " POP " 'face '(region bold))))
  (setq popper-display-control nil) ;; for shackle
  (setq popper-window-height 0.3)
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "\\*[Wo]Man.*\\*$"
          ;; "\\*Warnings\\*"
          "\\*Compile-Log\\*"
          "\\*vc-git : .*"

          help-mode
          helpful-mode

          compilation-mode
          comint-mode

          flymake-diagnostics-buffer-mode

          cider-repl-mode
          ansible-doc-module-mode))
  :hook
  (after-init-hook . popper-mode))
#+end_src

#+begin_src emacs-lisp
(use-package popper-echo
  :disabled
  :ensure popper
  :init
  (setq popper-echo-dispatch-actions t)
  (setq popper-echo-lines 3)
  :hook
  (after-init-hook . popper-echo-mode)
  ;; (after-init-hook . popper-tab-line-mode)
  )
#+end_src

* Buffers
** uniquify
#+begin_src emacs-lisp
(use-package uniquify
  :ensure nil
  :init
  (setq uniquify-buffer-name-style 'forward))
#+end_src

** buff-menu
#+begin_src emacs-lisp
(use-package buff-menu ;; see list-buffers
  :ensure nil
  :init
  (setq Buffer-menu-group-by '(Buffer-menu-group-by-root))
  (setq Buffer-menu-group-sort-by 'Buffer-menu-group-sort-alphabetically)
  (setq Buffer-menu-human-readable-sizes t))
#+end_src

** ibuffer
#+begin_src emacs-lisp
(use-package ibuffer
  :ensure nil
  :general
  ([remap list-buffers] 'ibuffer)
  :init
  (setq ibuffer-human-readable-size t))
#+end_src

** nerd-icons-ibuffer
#+begin_src emacs-lisp
(use-package nerd-icons-ibuffer
  :if +with-icons
  :hook
  (ibuffer-mode-hook . nerd-icons-ibuffer-mode))
#+end_src

** persistent-scratch
#+begin_src emacs-lisp
(use-package persistent-scratch
  :init
  (setq persistent-scratch-backup-file-name-format "%Y-%m-%d")
  (setq persistent-scratch-backup-directory
        (expand-file-name "persistent-scratch" user-emacs-directory))
  :hook
  (after-init-hook . persistent-scratch-setup-default))
#+end_src

* History
** savehist
#+begin_src emacs-lisp
(use-package savehist
  :ensure nil
  :hook
  (after-init-hook . savehist-mode))
#+end_src

