config.org
** saveplace
#+begin_src emacs-lisp
(use-package saveplace
  :ensure nil
  :hook
  (after-init-hook . save-place-mode))
#+end_src

** recentf
#+begin_src emacs-lisp
(use-package recentf
  :ensure nil
  :init
  (setq recentf-max-saved-items 300)
  :hook
  (after-init-hook . recentf-mode))
#+end_src

* Session Manager
** desktop
#+begin_src emacs-lisp
(use-package desktop
  :ensure nil
  :init
  (setq desktop-path `(,user-emacs-directory))
  :config
  (dolist (mode '(git-commit-mode))
    (add-to-list 'desktop-modes-not-to-save mode)))
#+end_src

* Completion
** emacs
#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :init
  (setq completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)
  (setq enable-recursive-minibuffers t)

  ;; Emacs 30 and newer: Disable Ispell completion function.
  ;; Try `cape-dict' as an alternative.
  (setq text-mode-ispell-word-completion nil)

  ;; Hide commands in M-x which do not apply to the current mode.  Corfu
  ;; commands are hidden, since they are not used via M-x. This setting is
  ;; useful beyond Corfu.
  (setq read-extended-command-predicate #'command-completion-default-include-p)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  :hook
  (minibuffer-setup-hook . cursor-intangible-mode))
#+end_src

** mouse
#+begin_src emacs-lisp
(use-package mouse
  :ensure nil
  :if (display-graphic-p)
  :hook
  (after-init-hook . context-menu-mode))
#+end_src

** nerd-icons-completion
#+begin_src emacs-lisp
(use-package nerd-icons-completion
  :if +with-icons
  :hook
  (vertico-mode-hook    . nerd-icons-completion-mode)
  (marginalia-mode-hook . nerd-icons-completion-marginalia-setup))
#+end_src

** consult
#+begin_src emacs-lisp
(use-package consult
  :general
  ([remap bookmark-jump]                 'consult-bookmark)
  ([remap goto-line]                     'consult-goto-line)
  ([remap imenu]                         'consult-imenu)
  ([remap locate]                        'consult-locate)
  ([remap load-theme]                    'consult-theme)
  ([remap man]                           'consult-man)
  ([remap recentf-open-files]            'consult-recent-file)
  ([remap switch-to-buffer]              'consult-buffer)
  ([remap switch-to-buffer-other-window] 'consult-buffer-other-window)
  ([remap switch-to-buffer-other-frame]  'consult-buffer-other-frame)
  ([remap yank-pop]                      'consult-yank-pop)
  ([remap project-find-regexp]           'consult-ripgrep)
  :init
  (setq register-preview-delay 0)
  (setq register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)
  :hook
  (completion-list-mode-hook . consult-preview-at-point-mode))
#+end_src

#+begin_src emacs-lisp
(use-package consult-xref
  :ensure consult
  :init
  (setq xref-show-xrefs-function #'consult-xref)
  (setq xref-show-definitions-function #'consult-xref))
#+end_src

** nerd-icons-xref
#+begin_src emacs-lisp
(use-package nerd-icons-xref
  :if +with-icons
  :hook
  (after-init-hook . nerd-icons-xref-mode))
#+end_src

** consult-dir
#+begin_src emacs-lisp
(use-package consult-dir
  :general
  ([remap list-directory] 'consult-dir))
#+end_src

** marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :general
  (minibuffer-local-map
    "M-A" 'marginalia-cycle)
  :hook
  (after-init-hook . marginalia-mode))
#+end_src

** vertico
#+begin_src emacs-lisp
(use-package vertico
  :general
  (vertico-map
   "C-j" 'vertico-next
   "C-k" 'vertico-previous)
  :init
  (setq vertico-cycle t)
  :hook
  (after-init-hook . vertico-mode))
#+end_src

#+begin_src emacs-lisp
(use-package vertico-directory
  :ensure vertico
  :general
  (vertico-map
   "DEL" 'vertico-directory-delete-char)
  :hook
  (rfn-eshadow-update-overlay-hook . vertico-directory-tidy))
#+end_src

** orderless
#+begin_src emacs-lisp
(use-package orderless
  :init
  (setq completion-styles '(orderless))
  (setq orderless-matching-styles '(orderless-literal
                                    ;; orderless-flex
                                    orderless-prefixes
                                    orderless-regexp))
  (setq completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

** corfu
#+begin_src emacs-lisp
(use-package corfu
  :general
  ("M-S-SPC" 'completion-at-point)
  :init
  (setq corfu-auto t)
  (setq corfu-cycle t)
  (setq corfu-min-width 40)
  :hook
  (after-init-hook . global-corfu-mode))
#+end_src

#+begin_src emacs-lisp
(use-package corfu-echo
  :ensure corfu
  :hook
  (corfu-mode-hook . corfu-echo-mode))
#+end_src

#+begin_src emacs-lisp
(use-package corfu-info
  :ensure corfu
  :unless (display-graphic-p)
  :after corfu
  :general
  (corfu-map
   "C-h" 'corfu-info-documentation))
#+end_src

#+begin_src emacs-lisp
(use-package corfu-popupinfo
  :ensure corfu
  :if (display-graphic-p)
  :general
  (corfu-map
   "C-h" 'corfu-popupinfo-documentation)
  :init
  (setq corfu-popupinfo-delay nil)
  :hook
  (corfu-mode-hook . corfu-popupinfo-mode))
#+end_src

#+begin_src emacs-lisp
(use-package corfu-history
  :ensure corfu
  :hook
  (corfu-mode-hook . corfu-history-mode))
#+end_src

** kind-icon
#+begin_src emacs-lisp
(use-package kind-icon
  :unless +with-icons
  :after corfu
  :demand
  :preface
  (defun +kind-icon-reset-cache (theme)
    (call-interactively 'kind-icon-reset-cache))
  :init
  (setq kind-icon-default-face 'corfu-default)
  (setq kind-icon-blend-background t)
  (setq kind-icon-use-icons nil)
  (setq kind-icon-extra-space nil)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
  (advice-add #'disable-theme :before #'+kind-icon-reset-cache))
#+end_src

** nerd-icons-corfu
#+begin_src emacs-lisp
(use-package nerd-icons-corfu
  :if +with-icons
  :after corfu
  :init
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

** cape
#+begin_src emacs-lisp
(use-package cape
  :general
  ("C-c p" 'cape-prefix-map)
  :hook
  ;; Add to the global default value of `completion-at-point-functions' which is
  ;; used by `completion-at-point'.  The order of the functions matters, the
  ;; first function returning a result wins.  Note that the list of buffer-local
  ;; completion functions takes precedence over the global list.
  (completion-at-point-functions . cape-dabbrev)
  (completion-at-point-functions . cape-file)
  (completion-at-point-functions . cape-elisp-block))
#+end_src

** embark
#+begin_src emacs-lisp
(use-package embark
  :general
  ("C-;" #'embark-act)
  (help-map
   "B" #'embark-bindings)
  :init
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))
#+end_src

** embark-consult
#+begin_src emacs-lisp
(use-package embark-consult
  :hook
  (embark-collect-mode-hook . consult-preview-at-point-mode))
#+end_src

** templ
#+begin_src emacs-lisp
(use-package tempel
  :preface
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.  `tempel-expand'
    ;; only triggers on exact matches. We add `tempel-expand' *before* the main
    ;; programming mode Capf, such that it will be tried first.
    (setq-local completion-at-point-functions
                (cons #'tempel-expand completion-at-point-functions)))
  :general
  (tempel-map
    "TAB" 'tempel-next)
  :hook
  (conf-mode-hook . tempel-setup-capf)
  (prog-mode-hook . tempel-setup-capf)
  (text-mode-hook . tempel-setup-capf)
  ;; Optionally make the Tempel templates available to Abbrev,
  ;; either locally or globally. `expand-abbrev' is bound to C-x '.
  (after-init-hook . global-tempel-abbrev-mode))
#+end_src

** tempel-collection
#+begin_src emacs-lisp
(use-package tempel-collection)
#+end_src

* Files
** files
#+begin_src emacs-lisp
(use-package files
  :ensure nil
  :init
  (setq require-final-newline t)
  (setq make-backup-files nil)
  (setq auto-save-default nil))
#+end_src

** autorevert
#+begin_src emacs-lisp
(use-package autorevert
  :ensure nil
  :init
  (setq auto-revert-avoid-polling t)
  (setq global-auto-revert-non-file-buffers t)
  :hook
  (after-init-hook . global-auto-revert-mode))
#+end_src

