config.org
** iqa
#+begin_src emacs-lisp
(use-package iqa
  :preface
  ;; for integration with project-tab-groups
  (defun +iqa-find-file-project (file)
    (let* ((dir (file-name-directory file))
           (default-directory dir))
      (project-current t)
      (find-file file)))
  :init
  (setq iqa-find-file-function #'+iqa-find-file-project)
  (setq iqa-user-init-file (locate-user-emacs-file "config.org")))
#+end_src

** epg
#+begin_src emacs-lisp
(use-package epg-config
  :ensure nil
  :init
  (setq epg-pinentry-mode 'loopback))
#+end_src

* Projects
** project
#+begin_src emacs-lisp
(use-package project
  :ensure nil
  :general
  (project-prefix-map
    "m" 'magit-project-status
    "b" 'consult-project-buffer)
  :init
  (setq project-buffers-viewer 'project-list-buffers-ibuffer)
  (setq project-kill-buffers-display-buffer-list t)
  (setq project-switch-commands
        '((project-find-file "Find file")
          (project-find-regexp "Find regexp")
          (project-find-dir "Find directory")
          (magit-project-status "Magit")))
  (setq project-vc-extra-root-markers '(".project")))
#+end_src

** disproject
#+begin_src emacs-lisp
(use-package disproject
  :general
  (project-prefix-map
    "." 'disproject-dispatch))
#+end_src

** projection
#+begin_src emacs-lisp
(use-package projection
  :general
  (project-prefix-map
    "P" '(:keymap projection-map :package projection-map :wk "projection"))
  :config
  (put 'projection-commands-configure-project 'safe-local-variable #'stringp)
  (put 'projection-commands-build-project     'safe-local-variable #'stringp)
  (put 'projection-commands-test-project      'safe-local-variable #'stringp)
  (put 'projection-commands-run-project       'safe-local-variable #'stringp)
  (put 'projection-commands-package-project   'safe-local-variable #'stringp)
  (put 'projection-commands-install-project   'safe-local-variable #'stringp)
  :hook
  (after-init-hook . global-projection-hook-mode))
#+end_src

** projection-multi
#+begin_src emacs-lisp
(use-package projection-multi
  :general
  (project-prefix-map
    "RET" 'projection-multi-compile))
#+end_src

#+begin_src emacs-lisp
(use-package projection-multi-embark
  :after embark
  :after projection-multi
  :demand t
  :config
  (projection-multi-embark-setup-command-map))
#+end_src

** project-x
#+begin_example
|------------|---------------|
|            |               |
| dired-side | magit-status* |
|            |               |
|------------|---------------|
#+end_example

#+begin_src emacs-lisp
(use-package project-x
  :ensure nil
  :demand t
  :general
  (project-prefix-map
   "l" #'project-x-open-layout)
  :init
  (setq project-x-layout '(dired-side-toggle magit-project-status))
  :config
  (add-to-list 'project-switch-commands '(project-x-open-layout "Layout") t))
#+end_src

* Dired
** dired
#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :init
  ;; -l     use a long listing format
  ;;
  ;; -A, --almost-all
  ;;        do not list implied . and ..
  ;;
  ;; -G, --no-group
  ;;        in a long listing, don't print group names
  ;;
  ;; -F, --classify[=WHEN]
  ;;        append indicator (one of */=>@|) to entries WHEN
  ;;
  ;; -h, --human-readable
  ;;        with -l and -s, print sizes like 1K 234M 2G etc.
  ;;
  ;; --sort=WORD
  ;;        change default 'name' sort to WORD: none (-U), size (-S), time
  ;;        (-t), version (-v), extension (-X), name, width
  ;;
  ;; --group-directories-first
  ;;        group directories before files
  ;;
  ;; --time-style=TIME_STYLE
  ;;        time/date format with -l; see TIME_STYLE below
  ;;
  (setq dired-listing-switches "-lAGFhv --group-directories-first --time-style=long-iso")
  (setq dired-auto-revert-buffer #'dired-directory-changed-p)
  (setq dired-dwim-target t)
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq dired-hide-details-hide-symlink-targets nil)
  (setq dired-mouse-drag-files t)
  (setq mouse-drag-and-drop-region-cross-program t)
  (setq dired-free-space nil)
  (setq dired-hide-details-hide-absolute-location t)
  (setq dired-create-destination-dirs-on-trailing-dirsep t)
  :config
  (when (eq system-type 'darwin)
    (setq insert-directory-program "gls"))
  :hook
  (dired-mode-hook . dired-hide-details-mode))
#+end_src

** dired-aux
#+begin_src emacs-lisp
(use-package dired-aux
  :ensure nil
  :init
  (setq dired-vc-rename-file t)
  (setq dired-create-destination-dirs 'ask))
#+end_src

** dired-x
#+begin_src emacs-lisp
(use-package dired-x
  :ensure nil
  :after dired
  :defer nil
  :general
  ( :keymaps 'dired-mode-map :states 'normal
    "M-." 'dired-omit-mode)
  :init
  (setq dired-omit-extensions nil)
  :config
  ;; Make dired-omit-mode hide all "dotfiles"
  (setq dired-omit-files
        (concat dired-omit-files "\\|^\\..*$")))
#+end_src

** dired-subtree
#+begin_src emacs-lisp
(use-package dired-subtree
  :demand t
  :after dired
  :general
  (dired-mode-map
   "<backtab>" 'dired-subtree-cycle)
  :init
  (setq dired-subtree-use-backgrounds nil)
  ;; Tabs scale with `text-scale-adjust', plain spaces don't.
  ;; Avoid artifacts when `dired-subtree' is used together with `nerd-icons-dired' and scaled fonts.
  (when +with-icons
    (setq dired-subtree-line-prefix "\t\t")))
#+end_src

** diredfl
#+begin_src emacs-lisp
(use-package diredfl
  :hook
  (dired-mode-hook . diredfl-mode))
#+end_src

** nerd-icons-dired
#+begin_src emacs-lisp
(use-package nerd-icons-dired
  :if +with-icons
  :hook
  (dired-mode-hook . nerd-icons-dired-mode)
  (dired-subtree-after-insert-hook . nerd-icons-dired--refresh))
#+end_src

** nerd-icons-multimodal
#+begin_src emacs-lisp
(use-package nerd-icons-multimodal
  :disabled ;; conflicts with dired-sidebar
  :if +with-icons
  :vc (:url "https://github.com/abougouffa/nerd-icons-multimodal" :rev :newest)
  :hook
  (dired-mode-hook   . nerd-icons-multimodal-mode)
  (archive-mode-hook . nerd-icons-multimodal-mode)
  (tar-mode-hook     . nerd-icons-multimodal-mode))
#+end_src

** dired-git-info
#+begin_src emacs-lisp
(use-package dired-git-info
  :general
  ( :keymaps 'dired-mode-map :states 'normal
    ")" 'dired-git-info-mode)
  :init
  (setq dgi-auto-hide-details-p nil))
#+end_src

** COMMENT dired-sidebar
#+begin_src emacs-lisp
(use-package dired-sidebar
  :disabled ; replaced by dired-side
  :autoload dired-sidebar-showing-sidebar-p
  :preface
  (defun +dired-sidebar-follow-file ()
    (interactive)
    (if (dired-sidebar-showing-sidebar-p)
        (dired-sidebar-follow-file)
      (dired-sidebar-jump-to-sidebar)))
  :init
  ;; (setq dired-sidebar-theme (if +with-icons 'nerd-icons 'none))
  (setq dired-sidebar-theme 'none) ;; don't need dired-sidebar's customizations for nerd-icons, it's flickery and buggy, just use nerd-icons-dired
  ;; (setq dired-sidebar-use-custom-modeline nil)
  (setq dired-sidebar-use-custom-modeline t)
  (setq dired-sidebar-mode-line-format nil) ;; hide mode-line
  (setq dired-sidebar-no-delete-other-windows t)
  (setq dired-sidebar-toggle-hidden-commands nil) ;; don't hide on `balance-windows'
  ;; (setq dired-sidebar-window-fixed nil)
  (setq dired-sidebar-use-custom-font t) ;; to custom `dired-sidebar-face'
  (setq dired-sidebar-face '(:height 0.9))
  (setq dired-sidebar-refresh-on-project-switch nil)
  (setq dired-sidebar-delay-auto-revert-updates nil) ; redundant with `auto-revert-avoid-polling'
  (setq dired-sidebar-refresh-on-special-commands nil) ; revert loop with subtrees
  :config
  (with-eval-after-load 'winum
    (defun winum-assign-0-to-dired-sidebar ()
      (when (and (eq major-mode 'dired-sidebar-mode)
                 (eq (selected-window) (frame-first-window)))
        0))
    (add-to-list 'winum-assign-functions #'winum-assign-0-to-dired-sidebar)))
#+end_src

