init.el
  ;; for integration with project-tab-groups
  (defun +iqa-find-file-project (file)
    (let* ((dir (file-name-directory file))
           (default-directory dir))
      (project-current t)
      (find-file file)))
  :init
  (setq iqa-find-file-function #'+iqa-find-file-project)
  (setq iqa-user-init-file (locate-user-emacs-file "config.org")))

(use-package epg-config
  :ensure nil
  :init
  (setq epg-pinentry-mode 'loopback))

(use-package project
  :ensure nil
  :general
  (project-prefix-map
   "m" 'magit-project-status
   "b" 'consult-project-buffer)
  :init
  (setq project-buffers-viewer 'project-list-buffers-ibuffer)
  (setq project-kill-buffers-display-buffer-list t)
  (setq project-switch-commands
        '((project-find-file "Find file")
          (project-find-regexp "Find regexp")
          (project-find-dir "Find directory")
          (magit-project-status "Magit")))
  (setq project-vc-extra-root-markers '(".project")))

(use-package disproject
  :general
  (project-prefix-map
   "." 'disproject-dispatch))

(use-package projection
  :general
  (project-prefix-map
   "P" '(:keymap projection-map :package projection-map :wk "projection"))
  :config
  (put 'projection-commands-configure-project 'safe-local-variable #'stringp)
  (put 'projection-commands-build-project     'safe-local-variable #'stringp)
  (put 'projection-commands-test-project      'safe-local-variable #'stringp)
  (put 'projection-commands-run-project       'safe-local-variable #'stringp)
  (put 'projection-commands-package-project   'safe-local-variable #'stringp)
  (put 'projection-commands-install-project   'safe-local-variable #'stringp)
  :hook
  (after-init-hook . global-projection-hook-mode))

(use-package projection-multi
  :general
  (project-prefix-map
   "RET" 'projection-multi-compile))

(use-package projection-multi-embark
  :after embark
  :after projection-multi
  :demand t
  :config
  (projection-multi-embark-setup-command-map))

(use-package project-x
  :ensure nil
  :demand t
  :general
  (project-prefix-map
   "l" #'project-x-open-layout)
  :init
  (setq project-x-layout '(dired-side-toggle magit-project-status))
  :config
  (add-to-list 'project-switch-commands '(project-x-open-layout "Layout") t))

(use-package dired
  :ensure nil
  :init
  ;; -l     use a long listing format
  ;;
  ;; -A, --almost-all
  ;;        do not list implied . and ..
  ;;
  ;; -G, --no-group
  ;;        in a long listing, don't print group names
  ;;
  ;; -F, --classify[=WHEN]
  ;;        append indicator (one of */=>@|) to entries WHEN
  ;;
  ;; -h, --human-readable
  ;;        with -l and -s, print sizes like 1K 234M 2G etc.
  ;;
  ;; --sort=WORD
  ;;        change default 'name' sort to WORD: none (-U), size (-S), time
  ;;        (-t), version (-v), extension (-X), name, width
  ;;
  ;; --group-directories-first
  ;;        group directories before files
  ;;
  ;; --time-style=TIME_STYLE
  ;;        time/date format with -l; see TIME_STYLE below
  ;;
  (setq dired-listing-switches "-lAGFhv --group-directories-first --time-style=long-iso")
  (setq dired-auto-revert-buffer #'dired-directory-changed-p)
  (setq dired-dwim-target t)
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq dired-hide-details-hide-symlink-targets nil)
  (setq dired-mouse-drag-files t)
  (setq mouse-drag-and-drop-region-cross-program t)
  (setq dired-free-space nil)
  (setq dired-hide-details-hide-absolute-location t)
  (setq dired-create-destination-dirs-on-trailing-dirsep t)
  :config
  (when (eq system-type 'darwin)
    (setq insert-directory-program "gls"))
  :hook
  (dired-mode-hook . dired-hide-details-mode))

(use-package dired-aux
  :ensure nil
  :init
  (setq dired-vc-rename-file t)
  (setq dired-create-destination-dirs 'ask))

(use-package dired-x
  :ensure nil
  :after dired
  :defer nil
  :general
  ( :keymaps 'dired-mode-map :states 'normal
    "M-." 'dired-omit-mode)
  :init
  (setq dired-omit-extensions nil)
  :config
  ;; Make dired-omit-mode hide all "dotfiles"
  (setq dired-omit-files
        (concat dired-omit-files "\\|^\\..*$")))

(use-package dired-subtree
  :demand t
  :after dired
  :general
  (dired-mode-map
   "<backtab>" 'dired-subtree-cycle)
  :init
  (setq dired-subtree-use-backgrounds nil)
  ;; Tabs scale with `text-scale-adjust', plain spaces don't.
  ;; Avoid artifacts when `dired-subtree' is used together with `nerd-icons-dired' and scaled fonts.
  (when +with-icons
    (setq dired-subtree-line-prefix "\t\t")))

(use-package diredfl
  :hook
  (dired-mode-hook . diredfl-mode))

(use-package nerd-icons-dired
  :if +with-icons
  :hook
  (dired-mode-hook . nerd-icons-dired-mode)
  (dired-subtree-after-insert-hook . nerd-icons-dired--refresh))

(use-package nerd-icons-multimodal
  :disabled ;; conflicts with dired-sidebar
  :if +with-icons
  :vc (:url "https://github.com/abougouffa/nerd-icons-multimodal" :rev :newest)
  :hook
  (dired-mode-hook   . nerd-icons-multimodal-mode)
  (archive-mode-hook . nerd-icons-multimodal-mode)
  (tar-mode-hook     . nerd-icons-multimodal-mode))

(use-package dired-git-info
  :general
  ( :keymaps 'dired-mode-map :states 'normal
    ")" 'dired-git-info-mode)
  :init
  (setq dgi-auto-hide-details-p nil))

(use-package dired-side
  :ensure nil
  :preface
