config.org
** dired-side
#+begin_src emacs-lisp
(use-package dired-side
  :ensure nil
  :preface
  (defun +dired-side-custom-face ()
    (face-remap-add-relative 'default :height 0.9))
  (defun +dired-side-point-at-file (file)
    "Reveal FILE in sidebar by expanding subtrees along the path."
    (when (and file (fboundp 'dired-subtree--is-expanded-p))
      ;; HACK: suppress diff-hl per-insert updates to avoid concurrent
      ;; git processes (index.lock conflict); call diff-hl-dired-update
      ;; once at the end instead
      (goto-char (point-min))
      (let* ((dired-subtree-after-insert-hook
              (remq '+diff-hl-dired-update dired-subtree-after-insert-hook))
             (root (dired-current-directory))
             (relative (file-relative-name file root))
             (parts (split-string relative "/" t))
             (path root))
        (dolist (part parts)
          (setq path (file-name-concat path part))
          (when (dired-goto-file-1 part (expand-file-name path) nil)
            (let ((pos (point)))
              (when (and (file-directory-p path)
                         (not (dired-subtree--is-expanded-p)))
                (dired-subtree-cycle))
              (setq path (file-name-as-directory path))
              (goto-char pos)))))
      (when (bound-and-true-p diff-hl-dired-mode)
        (diff-hl-dired-update))
      (when (bound-and-true-p nerd-icons-dired-mode)
        (nerd-icons-dired--refresh))))
  :init
  (setq dired-side-follow-file-function #'+dired-side-point-at-file)
  :config
  (with-eval-after-load 'winum
    (defun +winum-assign-0-to-dired-side ()
      (when (and (bound-and-true-p dired-side-mode)
                 (window-parameter (selected-window) 'window-side))
        0))
    (add-to-list 'winum-assign-functions #'+winum-assign-0-to-dired-side))
  :hook
  (dired-side-mode-hook . dired-hide-details-mode)
  (dired-side-mode-hook . mode-line-invisible-mode)
  (dired-side-mode-hook . +dired-side-custom-face))
#+end_src

* Environment Variables
** exec-path-from-shell
~$PATH~ from user's shell
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :if (or (memq window-system '(mac ns x)) (daemonp))
  :demand
  :init
  (setq exec-path-from-shell-arguments '("-l"))
  :config
  (exec-path-from-shell-initialize))
#+end_src

** with-editor
Use the ~emacsclient~ as the ~$EDITOR~ of child processes
#+begin_src emacs-lisp
(use-package with-editor
  :general
  ([remap shell-command]       'with-editor-shell-command)
  ([remap async-shell-command] 'with-editor-async-shell-command)
  :hook
  (shell-mode-hook   . with-editor-export-editor)
  (term-exec-hook    . with-editor-export-editor)
  (eshell-mode-hook  . with-editor-export-editor))
#+end_src

* Help
** help
#+begin_src emacs-lisp
(use-package help
  :ensure nil
  :general
  (help-map
   "F" 'describe-face))
#+end_src

** helpful
#+begin_src emacs-lisp
(use-package helpful
  :general
  ([remap describe-command]             'helpful-command)
  ([remap describe-key]                 'helpful-key)
  ([remap describe-variable]            'helpful-variable)
  ([remap describe-function]            'helpful-callable)
  ([remap Info-goto-emacs-command-node] 'helpful-function)
  (help-map
   "." 'helpful-at-point))
#+end_src

* Editor
** emacs
#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :init
  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil))
#+end_src

** delsel
#+begin_src emacs-lisp
(use-package delsel
  :ensure nil
  :general
  ("C-c C-g" 'minibuffer-keyboard-quit)
  :hook
  (after-init-hook . delete-selection-mode))
#+end_src

** simple
#+begin_src emacs-lisp
(use-package simple
  :ensure nil
  :hook
  (after-init-hook . column-number-mode))
#+end_src

** prog-mode
#+begin_src emacs-lisp
(use-package prog-mode
  :ensure nil
  :hook
  (after-init-hook . global-prettify-symbols-mode))
#+end_src

** so-long
#+begin_src emacs-lisp
(use-package so-long
  :ensure nil
  :hook
  (after-init-hook . global-so-long-mode))
#+end_src

** hungry-delete
#+begin_src emacs-lisp
(use-package hungry-delete
  :hook
  (after-init-hook . global-hungry-delete-mode))
#+end_src

** elec-pair
#+begin_src emacs-lisp
(use-package elec-pair
  :ensure nil
  :hook
  (after-init-hook . electric-pair-mode))
#+end_src

* Ediff
#+begin_src emacs-lisp
(use-package ediff
  :ensure nil
  :init
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-merge-split-window-function 'split-window-horizontally)
  :hook
  (ediff-prepare-buffer-hook . outline-show-all)
  (ediff-quit-hook . tab-bar-history-back))
#+end_src

* Undo/Redo
** undo-fu-session
#+begin_src emacs-lisp
(use-package undo-fu-session
  :init
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  :hook
  (after-init-hook . undo-fu-session-global-mode))
#+end_src

** vundo
#+begin_src emacs-lisp
(use-package vundo
  :general
  ("C-x u" 'vundo)
  :config
  (setq vundo-compact-display t)
  (setq vundo-glyph-alist vundo-unicode-symbols))
#+end_src

* Highlighting
** hl-line
#+begin_src emacs-lisp
(use-package hl-line
  :ensure nil
  :hook
  (after-init-hook . global-hl-line-mode))
#+end_src

** paren
#+begin_src emacs-lisp
(use-package paren
  :ensure nil
  :init
  (setq show-paren-when-point-inside-paren t)
  (setq show-paren-when-point-in-periphery t)
  :hook
  (after-init-hook . show-paren-mode))
#+end_src

** paren-face
#+begin_src emacs-lisp
(use-package paren-face
  :hook
  (after-init-hook . global-paren-face-mode))
#+end_src

** colorful-mode
#+begin_src emacs-lisp
(use-package colorful-mode)
#+end_src

** page-break-lines
#+begin_src emacs-lisp
(use-package page-break-lines
  :hook
  (after-init-hook . global-page-break-lines-mode))
#+end_src

** highlight-indent-guides
#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :init
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-responsive 'top))
#+end_src

** hl-todo
#+begin_src emacs-lisp
(use-package hl-todo
  :init
  (setq hl-todo-highlight-punctuation ":")
  ;; stolen from doom-emacs
  (setq hl-todo-keyword-faces
        '(;; For reminders to change or add something at a later date.
          ("TODO" warning bold)
          ;; For code (or code paths) that are broken, unimplemented, or slow,
          ;; and may become bigger problems later.
          ("FIXME" error bold)
          ;; For code that needs to be revisited later, either to upstream it,
          ;; improve it, or address non-critical issues.
          ("REVIEW" font-lock-keyword-face bold)
          ;; For code smells where questionable practices are used
          ;; intentionally, and/or is likely to break in a future update.
          ("HACK" font-lock-constant-face bold)
          ;; For sections of code that just gotta go, and will be gone soon.
          ;; Specifically, this means the code is deprecated, not necessarily
          ;; the feature it enables.
          ("DEPRECATED" font-lock-doc-face bold)
          ;; Extra keywords commonly found in the wild, whose meaning may vary
          ;; from project to project.
          ("NOTE" success bold)
          ("BUG" error bold)
          ("XXX" font-lock-constant-face bold)))
  :hook
  (after-init-hook . global-hl-todo-mode))
#+end_src

* Line Numbers
** display-line-numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :ensure nil
  :init
  (setq display-line-numbers-width-start t))
#+end_src

* Search
** anzu
#+begin_src emacs-lisp
(use-package anzu
  ;; :init
  ;; (setq anzu-cons-mode-line-p nil)
  :hook
  (after-init-hook . global-anzu-mode))
#+end_src

** evil-anzu
#+begin_src emacs-lisp
(use-package evil-anzu
  :if +with-evil
  :demand
  :after evil anzu)
#+end_src

* Folding
** hideshow
#+begin_src emacs-lisp
(use-package hideshow
  :ensure nil
  :init
  (setq hs-show-indicators t)
  (setq hs-allow-nesting t)
  :hook
  (prog-mode-hook . hs-minor-mode)
  (conf-mode-hook . hs-minor-mode)
  (yaml-ts-mode-hook . hs-minor-mode))
#+end_src

* Spell Checking
** COMMENT ispell
#+begin_src emacs-lisp
(use-package ispell
  :if (executable-find "hunspell")
  :ensure nil
  :after flyspell
  :init
  (setenv "LANG" "en_US.UTF-8")
  (setq ispell-really-aspell nil)
  (setq ispell-really-hunspell t)
  (setq ispell-dictionary "ru_RU,en_US")
  :config
  (setq ispell-program-name "hunspell")
  ;; ispell-set-spellchecker-params has to be called
  ;; before ispell-hunspell-add-multi-dic will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "ru_RU,en_US"))
#+end_src

