init.el

(use-package jinx
  :general
  ([remap ispell-word] 'jinx-correct)
  :init
  (setq jinx-languages "ru en es")
  :hook
  (text-mode-hook       . jinx-mode)
  (org-mode-hook        . jinx-mode)
  ;; (prog-mode-hook       . jinx-mode)
  (git-commit-mode-hook . jinx-mode))

(use-package flymake
  :ensure nil
  :general
  (project-prefix-map
   "D" 'flymake-show-project-diagnostics)
  :init
  (setq flymake-fringe-indicator-position 'right-fringe)
  (setq flymake-margin-indicator-position 'right-margin)
  (setq flymake-suppress-zero-counters t)
  :hook
  (prog-mode-hook . flymake-mode))

(use-package sideline
  :init
  (setq sideline-backends-right '(sideline-flymake))
  (setq sideline-display-backend-name t))

(use-package sideline-flymake
  :init
  (setq sideline-flymake-display-mode 'point)
  :hook
  (flymake-mode-hook . sideline-mode))

(use-package eros
  :hook
  (emacs-lisp-mode-hook . eros-mode))

(use-package quickrun)

(use-package apheleia
  :hook
  (after-init-hook . apheleia-global-mode))

(use-package xref
  :ensure nil
  :init
  (setq xref-search-program 'ripgrep)
  :hook
  (after-init-hook . global-xref-mouse-mode))

(use-package avy
  :init
  (setq avy-background t))

(use-package link-hint)

(use-package ghostel
  :preface
  (defun +ghostel-notify (title body)
    (let* ((proj (when-let* ((p (project-current)))
                   (project-name p)))
           (summary (if (or (null title) (string-empty-p title))
                        (buffer-name)
                      title))
           (summary (if (or (null proj) (string-empty-p proj))
                        summary
                      (format "%s: %s" proj summary))))
      (if (fboundp 'do-applescript)
          (do-applescript
           (format "display notification \"%s\" with title \"%s\"" body summary))
        (message "%s: %s" summary body))
      (when (fboundp 'system-taskbar-attention)
        (system-taskbar-attention 'critical))))
  (defun +ghostel-setup ()
    (setq-local nobreak-char-display nil) ;; don't render as `_'
    )
  :general
  (project-prefix-map
   "t" 'ghostel-project)
  :init
  (setq ghostel-shell "/opt/homebrew/bin/fish")
  (setq ghostel-macos-login-shell nil)
  (setq ghostel-notification-function #'+ghostel-notify)
  :config
  (add-to-list 'project-switch-commands '(ghostel-project "Ghostel") t)
  (add-to-list 'project-kill-buffer-conditions '(major-mode . ghostel-mode))
  :hook
  (ghostel-mode-hook . +ghostel-setup)
  (after-init-hook . ghostel-compile-global-mode)
  (after-init-hook . ghostel-comint-global-mode))

(use-package evil-ghostel
  :hook
  (ghostel-mode-hook . evil-ghostel-mode))

(use-package vc
  :ensure nil
  :init
  (setq vc-handled-backends '(Git))
  (setq vc-async-checkin t)
  (setq vc-allow-async-diff t)
  (setq vc-display-status 'no-backend))

(use-package magit
  :preface
  (defun +magit-worktree-switch-project (worktree)
    "Create .dir-locals.el with `project-vc-name' in WORKTREE.
Sets project-vc-name to \"project[worktree]\" so that `project.el'
can distinguish worktrees from the main checkout."
    (interactive
     (list (or (magit-section-value-if 'worktree)
               (magit-completing-read
                "Switch project in worktree"
                (magit-list-worktrees)
                nil t))))
    (let* ((path (if (listp worktree) (car worktree) worktree))
           (proj-orig (caar (magit-list-worktrees))))
      ;; Skip .dir-locals.el for primary worktree — it already has the
      ;; correct project name from its directory.
      (unless (string= (file-truename path) (file-truename proj-orig))
        (let* ((wt-name (file-name-nondirectory (directory-file-name path)))
               (proj-name (format "%s[%s]"
                                  (file-name-nondirectory (directory-file-name proj-orig))
                                  wt-name))
               (proj-new (project-current nil path)))
          (unless (and proj-new (equal (project-name proj-new) proj-name))
            (save-window-excursion
              (modify-dir-local-variable nil 'project-vc-name proj-name 'add-or-replace
                                         (expand-file-name ".dir-locals.el" path))
              (save-buffer)
              (kill-buffer)))))
      (project-remember-project (project-current nil path))
      (project-switch-project path)))
  :init
  (setq magit-define-global-key-bindings 'recommended)
  (setq magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  (setq magit-repository-directories `((,user-emacs-directory . 0)
                                       ("~/Projects/"         . 2)
                                       ("~/Developer/"        . 2)))
  (setq magit-diff-refine-hunk t)
  (setq magit-process-apply-ansi-colors t)
  (when +with-icons
    (setq magit-format-file-function #'magit-format-file-nerd-icons))
  :config
  (transient-append-suffix 'magit-worktree "g"
    '("p" "Switch project" +magit-worktree-switch-project))
  ;; https://github.com/magit/magit/issues/3230#issuecomment-339900039
  (magit-add-section-hook 'magit-status-sections-hook
                          'magit-insert-unpushed-to-upstream
                          'magit-insert-unpushed-to-upstream-or-recent
                          'replace))

(use-package magit-blame
  :ensure magit
  :config
  (add-to-list
   'magit-blame-styles
   '(margin
     (margin-format    . ("%C %a%f"))
     (time-format      . "%F")
     (margin-width     . 32)
     (margin-face      . magit-blame-margin)
     (margin-body-face . (magit-blame-dimmed))
     (show-message     . t))))

(use-package git-modes
  :mode ("/.dockerignore\\'" . gitignore-mode))
