init.el

(use-package diff-hl
  :preface
  (defun +diff-hl-fringe-bmp-empty (_type _pos) 'diff-hl-bmp-empty)
  ;; https://github.com/dgutov/diff-hl/issues/116#issuecomment-1573253134
  (let* ((width 4)
         (bitmap (vector (1- (expt 2 width)))))
    (define-fringe-bitmap '+diff-hl-bmp-thin bitmap 1 width '(top t)))
  (defun +diff-hl-fringe-bmp-thin (_type _pos) '+diff-hl-bmp-thin)
  (defun +diff-hl-update-faces (&optional _theme)
    "Adapt diff-hl faces for fringe bitmap rendering.
Fringe bitmaps use the face foreground color, not background.
Move each face's background color to foreground and clear the
background so our thin bitmap displays the indicator color correctly.
Covers both working-tree faces and reference-revision faces."
    (when (display-graphic-p)
      (dolist (face '(diff-hl-insert
                      diff-hl-delete
                      diff-hl-change
                      diff-hl-reference-insert
                      diff-hl-reference-delete
                      diff-hl-reference-change))
        (when-let* ((bg (face-background face nil t)))
          (set-face-foreground face bg) ;; fg -> bg
          (set-face-background face nil) ;; bg -> nil (transparent)
          ))))
  :init
  (setq diff-hl-disable-on-remote t)
  (setq diff-hl-update-async 'thread)
  (setq diff-hl-draw-borders nil)
  (setq diff-hl-margin-symbols-alist
        '((insert . " ") (delete . " ") (change . " ")
          (unknown . " ") (ignored . " ") (reference . " ")))
  ;; (setq diff-hl-fringe-bmp-function #'+diff-hl-fringe-bmp-empty)
  (setq diff-hl-fringe-bmp-function #'+diff-hl-fringe-bmp-thin)
  (setq diff-hl-fringe-flat-bmp '+diff-hl-bmp-thin)
  :hook
  (after-init-hook . global-diff-hl-mode)
  (after-init-hook . global-diff-hl-show-hunk-mouse-mode)
  (magit-post-refresh-hook . diff-hl-magit-post-refresh)
  (diff-hl-mode-hook . +diff-hl-update-faces)
  (enable-theme-functions . +diff-hl-update-faces))

(use-package diff-hl-flydiff
  :disabled
  :ensure diff-hl
  :init
  (setq diff-hl-flydiff-delay 0.5)
  :hook
  (diff-hl-mode-hook . diff-hl-flydiff-mode))

(use-package diff-hl-dired
  :ensure diff-hl
  :preface
  (defun +diff-hl-dired-update ()
    (when (and (bound-and-true-p diff-hl-dired-mode)
               (memq this-command '(dired-subtree-insert
                                    dired-subtree-toggle
                                    dired-subtree-cycle)))
      (diff-hl-dired-update)))
  :init
  (setq diff-hl-dired-extra-indicators nil)
  ;; (setq diff-hl-dired-fringe-bmp-function #'+diff-hl-fringe-bmp-empty)
  (setq diff-hl-dired-fringe-bmp-function #'+diff-hl-fringe-bmp-thin)
  :config
  ;; diff-hl overlays are zero-width (point, point) and survive `delete-region'
  ;; — they leak onto the next visible line. Remove them before subtree deletion.
  (define-advice dired-subtree-remove (:before () clean-diff-hl-overlays)
    "Remove diff-hl overlays in subtree region before deletion."
    (when (bound-and-true-p diff-hl-dired-mode)
      (-when-let (ov (dired-subtree--get-ov))
        (diff-hl-remove-overlays (overlay-start ov) (overlay-end ov)))))
  :hook
  (dired-mode-hook . diff-hl-dired-mode-unless-remote)
  (dired-subtree-after-insert-hook . +diff-hl-dired-update)
  (diff-hl-dired-mode-hook . +diff-hl-update-faces))

(use-package git-link)

(use-package difftastic
  :hook
  (after-init-hook . difftastic-bindings-mode))

(use-package git-timemachine)

(use-package org
  :ensure nil
  :init
  (setq org-modules nil)

  (setq org-directory "~/Org")

  ;; (setq org-startup-folded 'overview)
  (setq org-startup-indented t)
  (setq org-insert-heading-respect-content t)
  (setq org-hide-leading-stars t)

  (setq org-agenda-files '("todo.org"))
  (setq org-agenda-inhibit-startup t)
  (setq org-agenda-skip-unavailable-files t)

  (setq org-auto-align-tags nil)
  (setq org-tags-column 0)

  (setq org-ellipsis "…")
  ;; (setq org-ellipsis " ⌄ ")
  (setq org-pretty-entities t)
  ;; (setq org-hide-emphasis-markers t)
  (setq org-use-sub-superscripts '{}) ;; allow _ and ^ characters to sub/super-script strings but only when string is wrapped in braces

  (setq org-use-fast-todo-selection 'expert)
  (setq org-todo-keywords '((sequence
                             "TODO(t)"
                             "STARTED(s)"
                             "NEXT(n)"
                             "WAITING(w)"
                             "HOLD(h)"
                             "|"
                             "DONE(d)"
                             "OBSOLETE(o)"
                             "CANCELLED(c)")))

  (setq org-log-done 'time)

  (setq org-startup-with-link-previews t)

  (setq org-fontify-whole-heading-line t)
  (setq org-fontify-done-headline nil)

  (setq org-imenu-depth 6))

(use-package org-archive
  :ensure org
  :init
  (setq org-archive-location (concat org-directory "/archive.org::datetree/"))
  (setq org-archive-file-header-format nil))

(use-package org-refile
  :ensure org
  :preface
  ;; https://github.com/progfolio/.emacs.d#refile
  (defun +org-files-list ()
    "Returns a list of the file names for currently open Org files"
    (delq nil
          (mapcar (lambda (buffer)
                    (when-let* ((file-name (buffer-file-name buffer))
                                (directory (file-name-directory file-name)))
                      (unless (string-suffix-p "archives/" directory)
                        file-name)))
                  (org-buffer-list 'files t))))
  :init
  (setq org-refile-targets `((org-agenda-files :maxlevel . 3)
                             (+org-files-list  :maxlevel . 3)))
  (setq org-refile-use-outline-path 'file)
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-refile-use-cache t))

(use-package ol
  :ensure org
  :preface
  ;; source: https://gist.github.com/kim366/8abe978cc295b027df636b218862758e
  (defun +org-link-get-title (link &optional description)
    (cond
     ((string-match-p "^http" link)
      (with-temp-buffer
        (url-insert-file-contents link)
        (goto-char (point-min))
        (search-forward-regexp (rx "<title" (* (not (any ">"))) ">" (group (*? anything)) "</title>"))
        (match-string 1)))))
  :init
  (setq org-link-make-description-function #'+org-link-get-title))

(use-package org-src
  :ensure org
  :init
  (setq org-src-window-setup 'current-window)
  (setq org-src-content-indentation 0))

(use-package org-agenda
  :ensure org
  :init
  (setq org-agenda-window-setup 'current-window)
  (setq org-agenda-tags-column 0))

(use-package org-capture
  :ensure org
  :init
  (setq org-capture-templates
        `(("j" "Journal")
          ("jj" "Journal note" entry
           (file+olp+datetree ,(expand-file-name "journal.org" org-directory))
           "* %<%H:%M> - %^{Title|untitled} :journal:\n\n%?\n\n"
           :empty-lines 1)
          ("jm" "Meeting note" entry
           (file+olp+datetree ,(expand-file-name "journal.org" org-directory))
           "* %<%H:%M> - %^{Title|untitled} :meeting:\n\n%?\n\n"
           :empty-lines 1 :clock-in t :clock-resume t)
          )))
