config.org
** org-faces
#+begin_src emacs-lisp
(use-package org-faces
  :ensure org
  :init
  (setq org-fontify-quote-and-verse-blocks t)
  (setq org-priority-faces
        '((?A . (:inherit (bold error)))
          (?B . (:inherit (bold warning)))
          (?C . (:inherit (bold success)))))
  ;; TODO: simplify
  (setq org-todo-keyword-faces
        '(("STARTED"   . (:inherit (bold font-lock-constant-face org-todo)))
          ("NEXT"      . (:inherit (bold font-lock-constant-face org-todo)))
          ("WAITING"   . (:inherit (bold warning org-todo)))
          ("HOLD"      . (:inherit (bold warning org-todo)))
          ("OBSOLETE"  . (:inherit (bold shadow org-todo)))
          ("CANCELLED" . (:inherit (bold shadow org-todo))))))
#+end_src

** toc-org
#+begin_src emacs-lisp
(use-package toc-org
  :init
  (setq toc-org-max-depth 6)
  :hook
  (org-mode-hook . toc-org-enable))
#+end_src

** org-babel
*** ob-core
#+begin_src emacs-lisp
(use-package ob-core
  :ensure org
  :preface
  (defun +org-babel-add-lang (lang)
    "Enable LANG in `org-babel-load-languages'.
  Use instead of `org-babel-do-load-languages' to avoid
  overwriting `org-babel-load-languages'."
    (add-to-list 'org-babel-load-languages (cons lang t))
    (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))
  :init
  ;; built-in languages, for external use `+org-babel-add-lang'
  (setq org-babel-load-languages
        '((emacs-lisp . t)
          (shell      . t)
          (plantuml   . t)))
  (setq org-babel-results-keyword "results")
  :hook
  (org-babel-after-execute-hook . org-redisplay-inline-images))
#+end_src

*** ob-tangle
#+begin_src emacs-lisp
(use-package ob-tangle
  :ensure org
  :init
  (add-to-list 'safe-local-variable-values '(after-save-hook . org-babel-tangle)))
#+end_src

*** ob-plantuml
#+begin_src emacs-lisp
(use-package ob-plantuml
  :ensure nil
  :init
  (setq org-plantuml-exec-mode 'plantuml))
#+end_src

*** verb
#+begin_src emacs-lisp
(use-package verb
  :general
  (org-mode-map
   "C-c C-r" '(:keymap verb-command-map :package verb :wk "verb"))
  :init
  (setq verb-auto-kill-response-buffers t)
  (setq verb-json-use-mode 'json-ts-mode)
  :config
  (+org-babel-add-lang 'verb))
#+end_src

*** COMMENT tests
#+begin_src emacs-lisp :tangle no :results silent
(message "Hello World!")
#+end_src

#+begin_src sh :tangle no :results silent
echo "Hello World!"
#+end_src

#+begin_src plantuml :tangle no :results verbatim silent
Bob -> Alice : Hello World!
#+end_src

#+begin_src verb :tangle no :op send get-body :results silent
get https://github.com/status
#+end_src

** org-crypt
[[https://orgmode.org/worg/org-tutorials/encrypting-files.html][Encrypting org Files.]]
#+begin_src emacs-lisp
(use-package org-crypt
  :ensure org
  :init
  (setq org-tags-exclude-from-inheritance '("crypt"))
  ;; GPG key to use for encryption
  ;; Either the Key ID or set to nil to use symmetric encryption.
  (setq org-crypt-key nil)
  :config
  (org-crypt-use-before-save-magic))
#+end_src

* Notes
** deft
#+begin_src emacs-lisp
(use-package deft
  :general
  ( :keymaps 'deft-mode-map :states 'normal
    "gr" 'deft-refresh)
  :init
  (setq deft-directory (concat org-directory "/deft/"))
  (setq deft-extensions '("org"))
  (setq deft-use-filter-string-for-filename t)
  (setq deft-auto-save-interval 0) ;; disable
  (setq deft-file-naming-rules ;; kebab-case
        '((noslash . "-")
          (nospace . "-")
          (case-fn . downcase))))
#+end_src

* LSP
** eglot
#+begin_src emacs-lisp
(use-package eglot
  :ensure nil
  :general
  (+local-leader-def :keymaps 'eglot-mode-map
    "=" 'eglot-format
    "a" 'eglot-code-actions
    "R" 'eglot-rename
    "f" '(:ignore t :wk "find")
    "fd" 'eglot-find-declaration
    "ft" 'eglot-find-typeDefinition
    "fr" 'eglot-find-references
    "fi" 'eglot-find-implementation
    "h" '(:ignore t :wk "hierarchy")
    "hc" 'eglot-show-call-hierarchy
    "ht" 'eglot-show-type-hierarchy)
  :init
  (setq eglot-autoshutdown t)
  (setq eglot-sync-connect nil)
  (setq eglot-events-buffer-config '(:size 0 :format full))
  :config
  ;; https://github.com/doomemacs/doomemacs/blob/master/modules/tools/lsp/%2Beglot.el
  (defvar +eglot-defer-shutdown 3
    "Seconds to defer `eglot-shutdown' triggered by `eglot-autoshutdown'.")
  (define-advice eglot--managed-mode
      (:around (fn &rest args) +defer-shutdown)
    "Defer auto-shutdown so buffer kills don't block on slow LSP shutdown,
  and reopening project files within the window avoids a restart."
    (cl-letf* ((orig (symbol-function #'eglot-shutdown))
               ((symbol-function #'eglot-shutdown)
                (lambda (server &rest _)
                  (run-with-idle-timer
                   +eglot-defer-shutdown nil
                   (lambda ()
                     (unless (eglot--managed-buffers server)
                       (funcall orig server)))))))
      (apply fn args))))
#+end_src

Upgrade eglot to the latest version
#+begin_src emacs-lisp :tangle no
(eglot-upgrade-eglot)
#+end_src

#+begin_src emacs-lisp
(use-package consult-eglot
  :general
  (+local-leader-def :keymaps 'eglot-mode-map
    "fs" 'consult-eglot-symbols))

(use-package consult-eglot-embark
  :config
  (consult-eglot-embark-mode))
#+end_src

** dape
#+begin_src emacs-lisp
(use-package dape
  :init
  (setq dape-key-prefix (kbd "C-x C-a"))
  (setq dape-inlay-hints t)
  (setq dape-buffer-window-arrangement 'gud)
  (setq dape-breakpoint-margin-string "●")
  :config
  (dape-breakpoint-global-mode)
  :hook
  (kill-emacs-hook . dape-breakpoint-save)
  (after-init-hook . dape-breakpoint-load))
#+end_src

** mason
#+begin_src emacs-lisp
(use-package mason
  :hook
  (after-init-hook . mason-ensure))
#+end_src

* Languages
** treesit
#+begin_src emacs-lisp
(use-package treesit
  :ensure nil
  :init
  (setq treesit-font-lock-level 4))
#+end_src

** elisp
#+begin_src emacs-lisp
(use-package elisp-mode
  :ensure nil
  :init
  (setq elisp-fontify-semantically t))
#+end_src

#+begin_src emacs-lisp
(use-package highlight-defined
  :init
  (setq highlight-defined-face-use-itself t)
  :hook
  (emacs-lisp-mode-hook . highlight-defined-mode))
#+end_src

#+begin_src emacs-lisp
(use-package highlight-quoted
  :hook
  (emacs-lisp-mode-hook . highlight-quoted-mode))
#+end_src

#+begin_src emacs-lisp
(use-package macrostep
  :general
  (+local-leader-def :keymaps 'emacs-lisp-mode-map
    "m" 'macrostep-expand))
#+end_src

#+begin_src emacs-lisp
(use-package elisp-def
  :general
  (+local-leader-def :keymaps 'emacs-lisp-mode-map
    "d" 'elisp-def))
#+end_src

#+begin_src emacs-lisp
(use-package package-lint)
#+end_src

#+begin_src emacs-lisp
(use-package package-lint-flymake
  :hook
  (emacs-lisp-mode-hook . package-lint-flymake-setup))
#+end_src

** clojure
#+begin_src emacs-lisp
(use-package clojure-ts-mode)
#+end_src

#+begin_src emacs-lisp
(use-package cider
  :general
  (+local-leader-def :keymaps 'clojure-ts-mode-map
    "c" '(:ignore t           :wk "connect")
    "cc" '(cider-jack-in      :wk "jack-in")
    "cj" '(cider-jack-in-clj  :wk "jack-in-clj")
    "cs" '(cider-jack-in-cljs :wk "jack-in-cljs")
    "cC" '(cider-connect      :wk "connect")
    "cR" '(cider-restart      :wk "restart")
    "cQ" '(cider-quit         :wk "quit")

    "b" '(:ignore t           :wk "buffer")
    "bs" 'cider-scratch

    "=" '(cider-format-buffer :wk "format"))
  :init
  (setq cider-eldoc-display-context-dependent-info t)
  :hook
  (clojure-ts-mode-hook . cider-mode))
#+end_src

#+begin_src emacs-lisp
(use-package clj-refactor
  :disabled
  :general
  (+local-leader-def :keymaps 'clojure-ts-mode-map
    "R" '(hydra-cljr-help-menu/body :wk "refactor"))
  :hook
  (clojure-ts-mode-hook . clj-refactor-mode))
#+end_src

** golang
Install [[https://github.com/golang/tools/tree/master/gopls#installation][gopls]]
#+begin_src sh :tangle no :results silent
go install golang.org/x/tools/gopls@latest
#+end_src

Install [[https://github.com/go-delve/delve/tree/master/Documentation/installation][dlv]]
#+begin_src sh :tangle no :results silent
go install github.com/go-delve/delve/cmd/dlv@latest
#+end_src

#+begin_src emacs-lisp
(use-package go-ts-mode
  :ensure nil
  :init
  (setq go-ts-mode-indent-offset 4)
  :hook
  (go-ts-mode-hook . eglot-ensure))
#+end_src

** makefile
#+begin_src emacs-lisp
(use-package makefile-executor
  :general
  (+local-leader-def :keymaps 'makefile-mode-map
    "e" 'makefile-executor-execute-target)
  :hook
  (makefile-mode-hook . makefile-executor-mode))
#+end_src

** plantuml
#+begin_src emacs-lisp
(use-package plantuml-mode
  :general
  (+local-leader-def :keymaps 'plantuml-mode-map
    "p" '(plantuml-preview :wk "preview"))
  :init
  (setq plantuml-output-type (if (display-images-p) "png" "txt"))
  (setq plantuml-default-exec-mode 'executable))
#+end_src

